uouo00/STM32-Open207z-File-System-based-on-Winbond-SPI-Flash/STM32SPIImpl.c

#include <stdio.h>
#include <stdlib.h>
#include <STM32SPIImpl.h>
#include "STM32FlashFS_Logical.h"
#include "STM32FlashFS_FF.h"

#define STM32_NSS_PIN_PORT GPIOA
uint16_t STM32_NSS_PIN = GPIO_PIN_4;

#define VAT202_NSS_PIN GPIO_PIN_9
#define VAT202_NSS_PIN_PORT GPIOB

#define CHECK_ADDR(a,b) (a[0]==b[0] && a[1]==b[1] && a[2]==b[2])

uint8_t buffDeviceManu[2];
uint8_t buffRegStatus[3];

static SPI_HandleTypeDef* STM32SPIEntry = NULL;
static SPI_HandleTypeDef* STM32VATSPIEntry = NULL;









VATAPI_RESULT STM32SPIPageProgram(uint8_t *writebuf, uint8_t* writeaddr, uint32_t buff_size);
/*
ADRF6755_I2C ADRF6755_I2CEntry =
{
	.ReadReg = STM32ReadReg,
	.WriteReg = STM32WriteReg,
	.ReadMem = STM32ReadMem,
	.WriteMem = STM32WriteMem,
};
*/

void STM32InitSPI_NSSPin(){
	GPIO_InitTypeDef GPIO_InitStruct;

    GPIO_InitStruct.Pin = STM32_NSS_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(STM32_NSS_PIN_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin ((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN, GPIO_PIN_SET);
}

void VAT202InitSPI_NSSPin(){
	GPIO_InitTypeDef GPIO_InitStruct;

    GPIO_InitStruct.Pin = VAT202_NSS_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(VAT202_NSS_PIN_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin ((GPIO_TypeDef*) VAT202_NSS_PIN_PORT, VAT202_NSS_PIN, GPIO_PIN_SET);
}

//STM32 SPI FLASH
void STM32GetSPIHandler(SPI_HandleTypeDef* SPI_Struct)
{
	if(STM32SPIEntry == NULL)
		STM32SPIEntry = SPI_Struct;

	STM32InitSPI_NSSPin();
}

void NSS_Pin_high(){
	HAL_GPIO_WritePin ((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN, GPIO_PIN_SET);
}
void NSS_Pin_low(){
	HAL_GPIO_WritePin ((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN, GPIO_PIN_RESET);
}

//VAT202 SPI FLASH
void VAT202_start_update(){
	STM32_NSS_PIN=GPIO_PIN_9;
	STM32SPIEntry = STM32VATSPIEntry;	//debug
	//DBGSTR("SPI3 : %p",STM32SPIEntry);
	HAL_GPIO_WritePin ((GPIO_TypeDef*) POWER_ON_202_GPIO_Port, POWER_ON_202_Pin, GPIO_PIN_RESET);
	//DBGSTR("202 %d",HAL_GPIO_ReadPin((GPIO_TypeDef*) POWER_ON_202_GPIO_Port, POWER_ON_202_Pin));
	HAL_Delay(50);

	HAL_GPIO_WritePin ((GPIO_TypeDef*) SPI_UPDATE_EN_GPIO_Port, SPI_UPDATE_EN_Pin, GPIO_PIN_SET);
	//DBGSTR("UPDATE %d",HAL_GPIO_ReadPin((GPIO_TypeDef*) SPI_UPDATE_EN_GPIO_Port, SPI_UPDATE_EN_Pin));

}
void STM32GetVATSPIHandler(SPI_HandleTypeDef* SPI_Struct)
{
	if(STM32VATSPIEntry == NULL)
		STM32VATSPIEntry = SPI_Struct;

	VAT202InitSPI_NSSPin();
}
void VAT202_NSS_Pin_high(){
	HAL_GPIO_WritePin ((GPIO_TypeDef*) VAT202_NSS_PIN_PORT, VAT202_NSS_PIN, GPIO_PIN_SET);
}
void VAT202_NSS_Pin_low(){
	HAL_GPIO_WritePin ((GPIO_TypeDef*) VAT202_NSS_PIN_PORT, VAT202_NSS_PIN, GPIO_PIN_RESET);
}


/**
* @brief Read Manufacturer/Device ID
*
* The instruction is initiated by driving the /CS pin low and shifting the instruction code “90h”
* followed by a 24-bit address (A23-A0) of 000000h. After which, the Manufacturer ID for Winbond (EFh)
* and the Device ID are shifted out on the falling edge of CLK with most significant bit (MSB) first as
* shown in Figure 39. The Device ID values for the W25Q32FV are listed in Manufacturer and Device
* Identification table. The instruction is completed by driving /CS high.
*
*/
uint8_t* STM32SPIreadDeviceManu()
{
	HAL_StatusTypeDef nres;
	uint8_t command[6] = {SPI_WinbondW25Q32FV_readManuDeviceID, 0x00,0x00,0x00, SPI_WinbondW25Q32FV_DUMMY,SPI_WinbondW25Q32FV_DUMMY};

	NSS_Pin_low();
	//DBGSTR("GOIP NSS = %d",HAL_GPIO_ReadPin((GPIO_TypeDef*) GPIOE, GPIO_PIN_10));

	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buffDeviceManu[0], 1, 10)) != HAL_OK)
			DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[1], &buffDeviceManu[0], 1, 10)) != HAL_OK)
			DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[2], &buffDeviceManu[0], 1, 10)) != HAL_OK)
			DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[3], &buffDeviceManu[0], 1, 10)) != HAL_OK)
			DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[4], &buffDeviceManu[0], 1, 10)) != HAL_OK)
			DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[5], &buffDeviceManu[1], 1, 10)) != HAL_OK)
			DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);

	NSS_Pin_high();
	//DBGSTR("GOIP NSS = %d",HAL_GPIO_ReadPin((GPIO_TypeDef*) GPIOE, GPIO_PIN_10));
	DBGSTR("Manufacture=%x, DeviceID=%x",buffDeviceManu[0],buffDeviceManu[1]);

	return &buffDeviceManu[0];
}

/**
* @brief Read SPI Status
*
* The Read Status Register instruction may be used at any time, even while a Program,
* Erase or Write Status Register cycle is in progress. This allows the BUSY status bit
* to be checked to determine when the cycle is complete and if the device can accept
* another instruction. The Status Register can be read continuously, as shown in Figure 8.
* The instruction is completed by driving /CS high.
*
*/
uint8_t* STM32SPIReadStatus()
{
	HAL_StatusTypeDef nres;
	uint8_t command[4] = {SPI_WinbondW25Q32FV_readStatus_1, SPI_WinbondW25Q32FV_readStatus_2, SPI_WinbondW25Q32FV_readStatus_3, SPI_WinbondW25Q32FV_DUMMY};

	NSS_Pin_low();
	//DBGSTR("CS %d, STM32_NSS_PIN:%d, PA15:%d, PA4:%d",HAL_GPIO_ReadPin((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN),STM32_NSS_PIN,GPIO_PIN_15,GPIO_PIN_4);

	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buffRegStatus[0], 1, 100)) != HAL_OK)
		DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[3], &buffRegStatus[0], 1, 100)) != HAL_OK)
		DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);

	NSS_Pin_high();
	NSS_Pin_low();

