uouo00/STM32-Open207z-File-System-based-on-Winbond-SPI-Flash/STM32SPIImpl.c
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[1], &buffRegStatus[1], 1, 100)) != HAL_OK)
		DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[3], &buffRegStatus[1], 1, 100)) != HAL_OK)
		DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);

	NSS_Pin_high();
	NSS_Pin_low();
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[2], &buffRegStatus[2], 1, 100)) != HAL_OK)
		DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[3], &buffRegStatus[2], 1, 100)) != HAL_OK)
		DBGSTR("STM32SPIreadDeviceManu : send command fail! %d",nres);

	NSS_Pin_high();
	//DBGSTR("CS %d, STM32_NSS_PIN:%d, PA15:%d, PA4:%d",HAL_GPIO_ReadPin((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN),STM32_NSS_PIN,GPIO_PIN_15,GPIO_PIN_4);

	//HAL_Delay(100);
	//DBGSTR("Register status1=%x, status2=%x, status3=%x",buffRegStatus[0],buffRegStatus[1],buffRegStatus[2]);

	return &buffRegStatus[0];
}

/**
* @brief Loop until BUSY bit(In status register) are set to 0.
*
*/
void wait_for_BUSY(){
	uint8_t *regStatus1;

	do{
		regStatus1 = STM32SPIReadStatus();
	}while((regStatus1[0]&0x01) == 0x01);	//wait for BUSY bit
}


/**
* @brief Set WEL Bit to 1
*
* WEL Bit must be set to 1 before Page Program,
* Quad Page Program, Sector Erase, Block Erase, Chip Erase,
* Write Status Register and Erase/Program Security Registers instruction
*
*/
void write_enable(){
	HAL_StatusTypeDef nres;
	uint8_t command[1] = {SPI_WinbondW25Q32FV_writeEnable};
	uint8_t buff[2] = "";
	NSS_Pin_low();
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("Write_enable : send command fail! %d",nres);
	NSS_Pin_high();
}

/**
* @brief Set WEL Bit to 0
*
* WEL Bit must be set to 0 after Page Program,
* Quad Page Program, Sector Erase, Block Erase, Chip Erase,
* Write Status Register and Erase/Program Security Registers instruction
*
*/
void write_disable(){
	HAL_StatusTypeDef nres;
	uint8_t command[1] = {SPI_WinbondW25Q32FV_writeDisable};
	uint8_t buff[2] = "";

	NSS_Pin_low();
	DBGSTR("CS~ %d",HAL_GPIO_ReadPin((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN));
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("Write_disable : send command fail! %d",nres);
	NSS_Pin_high();
	DBGSTR("CS~ %d",HAL_GPIO_ReadPin((GPIO_TypeDef*) STM32_NSS_PIN_PORT, STM32_NSS_PIN));
}

/**
* @brief  sets all memory within the device to the erased state of all 1s (FFh).
*
*
*/
VATAPI_RESULT STM32SPIEraseChip()
{
	DBGSTR("Start to erase flash, wait for a while~");
	HAL_StatusTypeDef nres;
	uint8_t command[1] = {SPI_WinbondW25Q32FV_eraseChip}, buff[2];

	write_enable();
	wait_for_BUSY();
	NSS_Pin_low();
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK){
		DBGSTR("STM32SPIEraseChip : send command fail! %d",nres);
		return VAT_UNKNOWN;
	}
	NSS_Pin_high();
	wait_for_BUSY();
	DBGSTR("Finish to erase flash~~");

	return VAT_SUCCESS;
}


/**
* @brief sets all memory within a specified sector (4K-bytes) to the erased state of all 1s (FFh).
*
* @param *secAddr Address of specified sector.
*/
VATAPI_RESULT STM32SPIEraseSector(uint8_t *secAddr)
{
	HAL_StatusTypeDef nres;
	uint8_t addr[3] = {secAddr[0], secAddr[1], secAddr[2]};
	uint8_t command[1] = {SPI_WinbondW25Q32FV_eraseSector}, buff[2] = "";

	//DBGSTR("Start to erase the sector[0x%2x%2x%2x] of flash, wait for a while~",addr[0],addr[1],addr[2]);
	write_enable();
	wait_for_BUSY();
	NSS_Pin_low();

	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIEraseSector : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIEraseSector : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[1], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIEraseSector : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[2], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIEraseSector : send command fail! %d",nres);

	NSS_Pin_high();
	wait_for_BUSY();

	if(nres == HAL_OK){
		//DBGSTR("Finish to erase the sector[0x%2x%2x%2x] of flash~~",addr[0],addr[1],addr[2]);
		return VAT_SUCCESS;
	}

	return VAT_UNKNOWN;
}

/**
* @brief Read Data from specified sector
*
*
* @param *readbuf pointer to the buffer to store the data to be read.
* @param *readaddr pointer to the address of specified sector.
* @param buf_size size of buffer.
*/
VATAPI_RESULT STM32SPIReadSector(void *readbuf, uint8_t *readaddr, uint32_t buff_size){
	HAL_StatusTypeDef nres;
	uint8_t command[2] = {SPI_WinbondW25Q32FV_readData,SPI_WinbondW25Q32FV_DUMMY}, buff[2] = "";
	uint8_t addr[3] = {readaddr[0], readaddr[1], readaddr[2]};
	uint32_t i = 1, j = 0, k = 0;
	uint8_t* drop = pvPortMalloc(40 * sizeof(uint8_t));


	NSS_Pin_low();
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[1], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[2], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);

	if(nres != HAL_OK){
		vPortFree(drop);
		return VAT_UNKNOWN;
	}

	buff_size = buff_size + buff_size / 255;

	while(i <= buff_size){

		if((i % 256 != 0)){
			if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[1], &readbuf[j], 1, 10)) != HAL_OK){
				DBGSTR("STM32SPIReadMem : send command [%d] fail! %d",nres);
				vPortFree(drop);
				return VAT_UNKNOWN;
			}
			j++;
		}
		else{
			if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[1], &drop[k], 1, 10)) != HAL_OK){
				DBGSTR("STM32SPIReadMem : send command [%d] fail! %d",nres);
				vPortFree(drop);
				return VAT_UNKNOWN;
			}
			k++;
			}
		i++;
	}
	NSS_Pin_high();

	vPortFree(drop);
	return VAT_SUCCESS;
}


