uouo00/STM32-Open207z-File-System-based-on-Winbond-SPI-Flash/STM32SPIImpl.c
VATAPI_RESULT STM32SPIReadMem(void *readbuf, uint8_t *readaddr, uint32_t buff_size)
{
	HAL_StatusTypeDef nres;
	uint8_t command[2] = {SPI_WinbondW25Q32FV_readData,SPI_WinbondW25Q32FV_DUMMY}, buff[2] = "";
	uint8_t addr[3] = {readaddr[0], readaddr[1], readaddr[2]};
	uint32_t i = 0;

	NSS_Pin_low();
	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[1], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[2], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIReadMem : send command fail! %d",nres);

	if(nres != HAL_OK)
		return VAT_UNKNOWN;
	while(i < buff_size){


		if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[1], &readbuf[i], 1, 10)) != HAL_OK){
			DBGSTR("STM32SPIReadMem : send command [%d] fail! %d",nres);
			return VAT_UNKNOWN;
		}

		//DBGSTR("STM32SPIReadMem - 0x%2x%2x%2x[%d]=%x",addr[0], addr[1], addr[2],i,readbuf[i]);
		i++;
	}
	NSS_Pin_high();

	return VAT_SUCCESS;
}




/*
* @brief Write data to sector
*
* The Page Program instruction allows from one byte to 256 bytes (a page)
*  of data to be programmed at previously erased (FFh) memory locations.
*
* @param *writebuf pointer to buffer which contents data to be written into sector.
* @param *writeaddr pointer to address of sector to be written.
* @param buff_size size of data to be written into sector.
*/
VATAPI_RESULT STM32SPIPageProgram(uint8_t *writebuf, uint8_t* writeaddr, uint32_t buff_size)
{
	HAL_StatusTypeDef nres;
	uint8_t command[2] = {SPI_WinbondW25Q32FV_Page_Program,SPI_WinbondW25Q32FV_DUMMY}, buff[2] = "";
	uint8_t addr[3] = {writeaddr[0], writeaddr[1], writeaddr[2]};
	uint32_t i = 0;

	///!!!!
	//DBGSTR("Start to program the start address[0x%2x%2x%2x] of flash, wait for a while~",addr[0],addr[1],addr[2]);
	if(buff_size >= Page_bufferSize){		//sector 0,1 for flash usable record
		buff_size = Page_bufferSize;
		writebuf[buff_size-1] = 0;
	}
	//writebuf[buff_size-1] = 0;

	write_enable();
	wait_for_BUSY();
	NSS_Pin_low();

	if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &command[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIPageProgram : send command fail! %d",nres);

	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[0], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIPageProgram : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[1], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIPageProgram : send command fail! %d",nres);
	if((nres |= HAL_SPI_TransmitReceive(STM32SPIEntry, &addr[2], &buff[0], 1, 10)) != HAL_OK)
		DBGSTR("STM32SPIPageProgram : send command fail! %d",nres);

	if(nres != HAL_OK)
		return VAT_UNKNOWN;
	while(i < buff_size){
		if((nres = HAL_SPI_TransmitReceive(STM32SPIEntry, &writebuf[i], &buff[0], 1, 10)) != HAL_OK){
			DBGSTR("STM32SPIPageProgram : send command fail! %d",nres);
			NSS_Pin_high();
			wait_for_BUSY();
			return VAT_UNKNOWN;
		}
		//DBGSTR("STM32SPIPageProgram [%d]=0x%x, read=0x%x",i,writebuf[i],buff[0]);
		i++;
	}
	NSS_Pin_high();
	wait_for_BUSY();

	return VAT_SUCCESS;
}



/**
* @brief Write MultiPage to flash.
*
* Page Program allows only 256 bytes to be written in once. Hence, if to write data more than 256
* bytes. we have to divide write execution into multiple 255-bytes-write(see note below).
*
* @param *writebuf pointer to buffer which contents data to be written into sector.
* @param *writeaddr pointer to address of sector to be written.
* @param buff_size size of data to be written into sector.
*/
//uint8_t sectorBuf[4096] = "";
//uint8_t pagebuf[255]= "";

VATAPI_RESULT STM32SPIProgram_multiPage(uint8_t *writebuf, uint8_t *writeAddr, uint32_t buff_size){
	VATAPI_RESULT nres;
	uint8_t tmpaddr[3] = {writeAddr[0], writeAddr[1], writeAddr[2]};
	uint8_t* sectorBuf = pvPortMalloc(4096 * sizeof(uint8_t));
	uint8_t* pagebuf = pvPortMalloc(255* sizeof(uint8_t));

	if(sectorBuf == NULL) DBGSTR(".");
	memset(&sectorBuf[0],0,4096);
	memset(&pagebuf[0],0,255);
	uint32_t i = 0, tmp_convert1, times = 0;

	if(buff_size < Page_bufferSize - 1)
		times = 1;
	else{
		times = buff_size / (Page_bufferSize-1);
		if((buff_size%(Page_bufferSize-1))!=0)
			times++;
	}
	/* Note : According to winbond flash feature, the last bytes of every 256 bytes should be 0, so we need to plus one byte on every 256 bytes*/
	i = 0;
	while(i < times){
		memset(&pagebuf[0], 0, Page_bufferSize - 1);
		memcpy(&pagebuf[0], &writebuf[i*255], Page_bufferSize - 1);
		memcpy(&sectorBuf[i*Page_bufferSize], &pagebuf[0], Page_bufferSize - 1);
		sectorBuf[((i+1)*Page_bufferSize)-1] = 0;
		i++;
	}

	i = 0;
	while(i < times){
		if((nres=STM32SPIPageProgram(&sectorBuf[Page_bufferSize*i], &tmpaddr[0], Page_bufferSize)) != VAT_SUCCESS){
			DBGSTR("STM32SPIProgram_allData write data fail on %d times!",i);
			vPortFree(sectorBuf);
			vPortFree(pagebuf);
			return nres;
		}
		tmp_convert1 = (tmpaddr[0]<<16 | tmpaddr[1]<<8 | tmpaddr[2]) + Page_bufferSize;
		tmpaddr[0] = (tmp_convert1&0xFF0000) >> 16;
		tmpaddr[1] = (tmp_convert1&0xFF00) >>8;
		tmpaddr[2] = 0x00;
		i++;
	}
	vPortFree(sectorBuf);
	vPortFree(pagebuf);
	return nres;
}



VATAPI_RESULT STM32SPIWriteSector(void *writebuf, uint8_t* SectorAddr, uint32_t buff_size){



	if(STM32SPIEraseSector(SectorAddr) == VAT_SUCCESS){
		//DBGSTR("ERASE SECTOR - 0x%2x %2x %2x", SectorAddr[0], SectorAddr[1], SectorAddr[2]);
	}else return VAT_UNKNOWN;
	if(STM32SPIProgram_multiPage(writebuf, SectorAddr, buff_size) == VAT_SUCCESS){
		//DBGSTR("WRTIE SECTOR SUCCESSFUL");
		return VAT_SUCCESS;
	}else return VAT_UNKNOWN;

	return VAT_UNKNOWN;

