uouo00/STM32-Open207z-File-System-based-on-Winbond-SPI-Flash/STM32SPIImpl.c
}




/*
 * =================================================================================================
 * =============== Winbond  Flash Utility
 * =================================================================================================
 */

uint8_t programBuf[SPI_WinbondW25Q32FV_sectorByte];

uint8_t *STM32SPI_getProgramBuf(){
	return &programBuf[0];
}



VATAPI_RESULT STM32SPI_Customize_program(SPIProperties_Customize *data){
	VATAPI_RESULT nres;
	uint8_t* writeBuf = pvPortMalloc(255 * sizeof(uint8_t));
	int FileNodeId;
	sprintf((char *)writeBuf, CUSTOMIZE_TXT, data->channelNum, data->Country, data->LCD_Timeout, data->OutputLevel, data->HDCP, \
				data->EP9555E_Control, data->reserved);
	DBGSTR("%s",writeBuf);

	if(CreateFile(Winbond_FlashFW_ChannelTable,writeBuf,strlen(writeBuf)) != VAT_SUCCESS){
		DBGSTR("Fail to Program Customized data");
		vPortFree(writeBuf);
		return VAT_UNKNOWN;
	}
	else{
		DBGSTR("STM32SPI_Customize_program successfully!");
	}
	vPortFree(writeBuf);
	return nres;
}


/*
 * =================================================================================================
 * =============== 202 Flash Utility
 * =================================================================================================
 */
VATAPI_RESULT STM32SPIReadMem_For202(){
	VATAPI_RESULT nres;
	uint8_t* read_buf = pvPortMalloc(SPI_WinbondW25Q32FV_sectorByte * sizeof(uint8_t));
	uint8_t read_addr[3] = {0x00,0x00,0x00};
	uint32_t i = 0;

	nres = STM32SPIReadMem(&read_buf[0], &read_addr[0], SPI_WinbondW25Q32FV_sectorByte);			//flash usable status map
	if(nres == VAT_SUCCESS){
		while(i < SPI_WinbondW25Q32FV_sectorByte){
			DBGSTR("[%d]=%x",i,read_buf[i]);
			i++;
		}
	}
	pvPortFree(read_buf);
	return nres;
}

VATAPI_RESULT STM32SPIReadFlag_For202(uint8_t *flag_value){
	VATAPI_RESULT nres;
	uint8_t read_addr[3] = {0x3F,0x00,0x00}, read_buf[4];

	nres = STM32SPIReadMem(&read_buf[0], &read_addr[0], sizeof(read_buf));			//flash usable status map
	if(nres == VAT_SUCCESS){
		memcpy(flag_value, &read_buf[0], sizeof(read_buf));
		//DBGSTR("%x %x %x %x",flag_value[0],flag_value[1],flag_value[2],flag_value[3]);
	}
	return nres;
}

void STM32SPIWriteFlag_noCheck(uint8_t *flag_value){
	VATAPI_RESULT nres;
	uint8_t program_addr[3] = {0x3F,0x00,0x00}, program_buf[4] = {flag_value[0], flag_value[1], flag_value[2], flag_value[3]};
	uint8_t readflag[4];
	int i = 0;

	if(STM32SPIEraseSector(&program_addr[0]) == VAT_SUCCESS){
		DBGSTR("STM32SPIWriteFlag_For202 - Finish to erase sector(0x%2x%2x%2x)", program_addr[0], program_addr[1], program_addr[2]);
	}

	if((nres=STM32SPIPageProgram(&program_buf[0], &program_addr[0], sizeof(program_buf))) != VAT_SUCCESS){
		DBGSTR("STM32SPIWriteFlag_For202 write data fail on %d times!",i);
	}

}

VATAPI_RESULT STM32SPIWriteFlag_For202(uint8_t *flag_value){
	VATAPI_RESULT nres;
	uint8_t program_addr[3] = {0x3F,0x00,0x00}, program_buf[4] = {flag_value[0], flag_value[1], flag_value[2], flag_value[3]};
	uint8_t readflag[4], burnFlag = 0xFF & STM32FlashFW_Burn202_Flag;
	int i = 0;

	if(STM32SPIEraseSector(&program_addr[0]) == VAT_SUCCESS){
		DBGSTR("STM32SPIWriteFlag_For202 - Finish to erase sector(0x%2x%2x%2x)", program_addr[0], program_addr[1], program_addr[2]);
	}else return VAT_UNKNOWN;

	if((nres=STM32SPIPageProgram(&program_buf[0], &program_addr[0], sizeof(program_buf))) != VAT_SUCCESS){
		DBGSTR("STM32SPIWriteFlag_For202 write data fail on %d times!",i);
		return VAT_UNKNOWN;
	}

	nres = STM32SPIReadFlag_For202(&readflag[0]);
	if((readflag[0]&readflag[1]&readflag[2]&readflag[3]) == burnFlag)
		DBGSTR("%x %x %x %x,jump to upgrade 202 FW~~\r\n\n",readflag[0], readflag[1], readflag[2], readflag[3]);
	else{
		DBGSTR("error flag - %x %x %x %x",readflag[0], readflag[1], readflag[2], readflag[3]);
		return VAT_UNKNOWN;
	}

	return nres;
}

VATAPI_RESULT STM32SPIProgramData_For202(uint8_t *writebuf, uint32_t data_type, uint32_t buff_size, uint32_t writeAddr){
	VATAPI_RESULT nres;
	uint8_t program_addr[3] = {(writeAddr>>16)&0xFF, (writeAddr>>8)&0xFF, writeAddr&0xFF}, program_buf[128];
	uint32_t write_times = buff_size / sizeof(program_buf), tmp_convert1;
	int i = 0;

	if(buff_size % sizeof(program_buf) > 0)
		write_times++;

	DBGSTR("write addr 0x%2x%2x%2x",program_addr[0],program_addr[1],program_addr[2]);
	while(i < write_times){
		if((nres=STM32SPIPageProgram(&writebuf[sizeof(program_buf)*i], &program_addr[0], sizeof(program_buf))) != VAT_SUCCESS){
			DBGSTR("STM32SPIProgramData_For202 write data fail on %d times!",i);
			return nres;
		}
		tmp_convert1 = (program_addr[0]<<16 | program_addr[1]<<8 | program_addr[2]) + sizeof(program_buf);
		program_addr[0] = (tmp_convert1&0xFF0000) >> 16;
		program_addr[1] = (tmp_convert1&0xFF00) >>8;
		program_addr[2] = tmp_convert1&0xFF;
		i++;
	}
	return nres;
}

VATAPI_RESULT STM32SPI_202_FWprogram(uint8_t *data, uint32_t size, uint8_t flag, uint32_t writeAddr){
	VATAPI_RESULT nres;

	if(flag == 0)
    	STM32SPIEraseChip();

	//DBGSTR("start burn modulator FW to flash, size=%d",size);

	if((nres = STM32SPIProgramData_For202(data, SPI_202WinbondW25Q32BV_TYPE_all, size, writeAddr)) == VAT_SUCCESS){
		//DBGSTR("STM32SPI_202_FWprogram successfully!");
	}
	else
		DBGSTR("STM32SPI_202_FWprogram unsuccessfully! Please re-plug USB, and reload channel table again!");

	return nres;
}

/*
 * =================================================================================================
 * =============== STM32 Flash Utility
 * =================================================================================================
 */

uint8_t stm32programBuf[4096];

uint8_t *STM32flash_getProgramBuf(){
	return &stm32programBuf[0];
}

int flash_erase_sec(int sec_no)
{
	FLASH_EraseInitTypeDef er = {
		.TypeErase = FLASH_TYPEERASE_SECTORS,		//all erase
		.Sector = sec_no,		//FLASH_SECTOR_0~5
		.NbSectors = 1,
		.VoltageRange = FLASH_VOLTAGE_RANGE_3,
		//.Banks = FLASH_BANK_1,
	};
	uint32_t fault_sec = 0;
	HAL_FLASH_Unlock();
	DBGSTR("start erase sector : %d",sec_no);
	HAL_StatusTypeDef res = HAL_FLASHEx_Erase(&er, &fault_sec);
	DBGSTR("finish~");
	HAL_FLASH_Lock();

	HAL_Delay(50);
	return res == HAL_OK ? 0 : -1;
}

void Write_STM32FlashFlag(uint32_t newIAPFlag_Addr, uint8_t* flag){
	HAL_StatusTypeDef status;
	uint32_t i = 0;

