uouo00/STM32-Open207z-File-System-based-on-Winbond-SPI-Flash/STM32SPIImpl.c
	HAL_FLASH_Unlock();
	while(i < sizeof(uint32_t)){
		if((status = HAL_FLASH_Program(TYPEPROGRAM_BYTE, newIAPFlag_Addr, flag[i])) == HAL_OK){
			//DBGSTR("Writing[0x%x]:%x~~~~~",newIAPFlag_Addr,flag[i]);
			i++;
			newIAPFlag_Addr++;
		}
		else
			DBGSTR("Write fail. status : %d",status);
	}
	HAL_FLASH_Lock();
}

void WriteRevise(uint32_t *startAddr, uint8_t *data, uint32_t size, uint32_t writeSectorType, uint8_t erase_flag)
{
	HAL_StatusTypeDef status;
	uint32_t i = 0, writeAddr = *startAddr;


	DBGSTR("WriteRevise~~~size:%d",size);
	HAL_Delay(500);

	if(writeSectorType == STM32EraseFlash_APPSectors && erase_flag == 0){		//first time need to erase APP flash space
		uint32_t newIAPFlag_Addr = STM32FlashFW_Bootloader_STARTADDR;
		uint8_t flag[] = {0xF0, 0xF0, 0xF0, 0xF0};
			if(flash_erase_sec(FLASH_SECTOR_3) == HAL_OK){
				if(flash_erase_sec(FLASH_SECTOR_4) == HAL_OK){
					DBGSTR("Erase flash successfully!");

					HAL_FLASH_Unlock();
					while(i < sizeof(flag)){
						if((status = HAL_FLASH_Program(TYPEPROGRAM_BYTE/*TYPEPROGRAM_BYTE*/, newIAPFlag_Addr, flag[i])) == HAL_OK){
							//DBGSTR("Writing[0x%x]~~~~~",writeAddr);
							i++;
							newIAPFlag_Addr++;
						}
						else
							DBGSTR("Write fail. status : %d",status);
					}
					HAL_FLASH_Lock();
					i = 0;
				}
				else
					DBGSTR("Erase APP flash fail!");
			}
			else
				DBGSTR("Erase APP flash fail!");
	}
	else if(writeSectorType == STM32EraseFlash_IAPSectors && erase_flag == 0){		//first time need to erase IAP flash space
		uint32_t newIAPFlag_Addr = STM32FlashFW_Bootloader_STARTADDR;
		uint8_t flag[] = {0xF2, 0xF2, 0xF2, 0xF2};
		if(flash_erase_sec(FLASH_SECTOR_0) == HAL_OK){
			if(flash_erase_sec(FLASH_SECTOR_1) == HAL_OK){
				if(flash_erase_sec(FLASH_SECTOR_2) == HAL_OK){
					DBGSTR("Erase flash successfully!");

					HAL_FLASH_Unlock();
					while(i < sizeof(flag)){
							if((status = HAL_FLASH_Program(TYPEPROGRAM_BYTE/*TYPEPROGRAM_BYTE*/, newIAPFlag_Addr, flag[i])) == HAL_OK){
								//DBGSTR("Writing[0x%x]~~~~~",writeAddr);
								i++;
								newIAPFlag_Addr++;
							}
							else
								DBGSTR("Write fail. status : %d",status);
					}
					HAL_FLASH_Lock();
					i = 0;
				}else DBGSTR("Erase APP flash fail!");
			}else DBGSTR("Erase APP flash fail!");
		}else DBGSTR("Erase APP flash fail!");
	}else if(writeSectorType == STM32EraseFlash_BootloaderSectors && erase_flag == 0){		//first time need to erase bootloader flash space
		uint32_t newIAPFlag_Addr = STM32FlashFW_Bootloader_STARTADDR;
		uint8_t flag[] = {0xF3, 0xF3, 0xF3, 0xF3};
		if(flash_erase_sec(FLASH_SECTOR_3) == HAL_OK){
			if(flash_erase_sec(FLASH_SECTOR_4) == HAL_OK){
					DBGSTR("Erase flash successfully!");

					HAL_FLASH_Unlock();
					while(i < sizeof(flag)){
							if((status = HAL_FLASH_Program(TYPEPROGRAM_BYTE/*TYPEPROGRAM_BYTE*/, newIAPFlag_Addr, flag[i])) == HAL_OK){
								//DBGSTR("Writing[0x%x]~~~~~",writeAddr);
								i++;
								newIAPFlag_Addr++;
							}
							else DBGSTR("Write fail. status : %d",status);
					}
					HAL_FLASH_Lock();
					i = 0;
			}else DBGSTR("Erase APP flash fail!");
		}else DBGSTR("Erase APP flash fail!");
	}
	else{

	}
	HAL_FLASH_Unlock();
	//HAL_FLASHEx_Erase(0x8016000);
	while(i < size){
		if((status = HAL_FLASH_Program(TYPEPROGRAM_BYTE/*TYPEPROGRAM_BYTE*/, writeAddr, data[i])) == HAL_OK){
			//DBGSTR("Writing[0x%x]~~~~~",writeAddr);
			i++;
			writeAddr++;
		}
		else
			DBGSTR("Write fail. status : %d",status);
	}
	HAL_FLASH_Lock();

	*startAddr = writeAddr;
	DBGSTR("WriteRevise down- ~~",status);
}










